/*              #########                       
              ############                     
              #############                    
             ##  ###########                   
            ###  ###### #####                  
            ### #######   ####                 
           ###  ########## ####                
          ####  ########### ####               
         ####   ###########  #####             
        #####   ### ########   #####           
       #####   ###   ########   ######         
      ######   ###  ###########   ######       
     ######   #### ##############  ######      
    #######  #####################  ######     
    #######  ######################  ######    
   #######  ###### #################  ######   
   #######  ###### ###### #########   ######   
   #######    ##  ######   ######     ######   
   #######        ######    #####     #####    
    ######        #####     #####     ####     
     #####        ####      #####     ###      
      #####       ###        ###      #        
        ###       ###        ###              
         ##       ###        ###               
__________#_______####_______####______________
    身是菩提树，心如明镜台，时时勤拂拭，勿使惹尘埃。
                我们的未来没有BUG              
* ==============================================================================
* Filename: EmenyMove
* Created:  $time$
* Author:   WYC
* Purpose:  随机位置移动
* ==============================================================================
*/
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class EmenyMove : MonoBehaviour
{

    public float speed = 4;
    private float timer = 0;
    private float dir1 = 0;
    private float dir2 = 0;
	void Start () {
		
	}
	
	
	void Update ()
	{
	    timer += Time.deltaTime;
	    if (timer > 3)
	    {
	         dir1 = Random.Range(-1, 1f);
	         dir2 = Random.Range(-1, 1f);
	        timer = 0;
	    }
	   

        transform.Translate(new Vector3(dir1, 0, dir2) *speed*Time.deltaTime);
	}
}
