/*              #########                       
              ############                     
              #############                    
             ##  ###########                   
            ###  ###### #####                  
            ### #######   ####                 
           ###  ########## ####                
          ####  ########### ####               
         ####   ###########  #####             
        #####   ### ########   #####           
       #####   ###   ########   ######         
      ######   ###  ###########   ######       
     ######   #### ##############  ######      
    #######  #####################  ######     
    #######  ######################  ######    
   #######  ###### #################  ######   
   #######  ###### ###### #########   ######   
   #######    ##  ######   ######     ######   
   #######        ######    #####     #####    
    ######        #####     #####     ####     
     #####        ####      #####     ###      
      #####       ###        ###      #        
        ###       ###        ###              
         ##       ###        ###               
__________#_______####_______####______________
    身是菩提树，心如明镜台，时时勤拂拭，勿使惹尘埃。
                我们的未来没有BUG              
* ==============================================================================
* Filename: Helloword01
* Created:  $time$
* Author:   WYC
* Purpose:  
* ==============================================================================
*/
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using XLua;

public class Helloword01 : MonoBehaviour
{
    private LuaEnv luaEnv;


    void Start ()
	{
	    luaEnv = new LuaEnv();
	    luaEnv.DoString("print('Hello World!!!')");
	    luaEnv.DoString("CS.UnityEngine.Debug.Log( '你好世界！！')");

	}

    void OnDestroy()
    {
        luaEnv.DoString("print(' 资源释放 !!!')");
        luaEnv.Dispose();//资源释放
    }

    void Update () {
		
	}
}
