/*              #########                       
              ############                     
              #############                    
             ##  ###########                   
            ###  ###### #####                  
            ### #######   ####                 
           ###  ########## ####                
          ####  ########### ####               
         ####   ###########  #####             
        #####   ### ########   #####           
       #####   ###   ########   ######         
      ######   ###  ###########   ######       
     ######   #### ##############  ######      
    #######  #####################  ######     
    #######  ######################  ######    
   #######  ###### #################  ######   
   #######  ###### ###### #########   ######   
   #######    ##  ######   ######     ######   
   #######        ######    #####     #####    
    ######        #####     #####     ####     
     #####        ####      #####     ###      
      #####       ###        ###      #        
        ###       ###        ###              
         ##       ###        ###               
__________#_______####_______####______________
    身是菩提树，心如明镜台，时时勤拂拭，勿使惹尘埃。
                我们的未来没有BUG              
* ==============================================================================
* Filename: Text10
* Created:  $time$
* Author:   WYC
* Purpose:  
* ==============================================================================
*/
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Text10 : MonoBehaviour {

	
	void Start () {
        XiaoJie xiaoJie1 = new XiaoJie();
        xiaoJie1.name = "xxxx";
        XiaoJie xiaoJie2 = xiaoJie1;
        xiaoJie2.name = "wwww";
        Debug.Log(xiaoJie1.name);

        int number = 11;
        Num(ref number);
        Debug.Log(number);
    }

    public void Num(ref int num) {
        num += 10;
    }
	
	void Update () {
		
	}
}
class XiaoJie
{
    public string name;

}